docs/evidence/04-circuit-breaker/solution/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/scripts/phase4-slow-product.js
        output: Prometheus remote write (http://34.64.219.137:30090/api/v1/write)

     scenarios: (100.00%) 2 scenarios, 35 max VUs, 1m0s max duration (incl. graceful stop):
              * order_creation: 30 looping VUs for 30s (exec: createOrder, gracefulStop: 30s)
              * order_query: 5 looping VUs for 30s (exec: queryOrders, gracefulStop: 30s)


running (0m01.0s), 35/35 VUs, 5 complete and 0 interrupted iterations
order_creation   [   3% ] 30 VUs  01.0s/30s
order_query      [   3% ] 5 VUs   01.0s/30s

running (0m02.0s), 35/35 VUs, 15 complete and 0 interrupted iterations
order_creation   [   7% ] 30 VUs  02.0s/30s
order_query      [   7% ] 5 VUs   02.0s/30s

running (0m03.0s), 35/35 VUs, 25 complete and 0 interrupted iterations
order_creation   [  10% ] 30 VUs  03.0s/30s
order_query      [  10% ] 5 VUs   03.0s/30s

running (0m04.0s), 35/35 VUs, 35 complete and 0 interrupted iterations
order_creation   [  13% ] 30 VUs  04.0s/30s
order_query      [  13% ] 5 VUs   04.0s/30s

running (0m05.0s), 35/35 VUs, 45 complete and 0 interrupted iterations
order_creation   [  17% ] 30 VUs  05.0s/30s
order_query      [  17% ] 5 VUs   05.0s/30s

running (0m06.0s), 35/35 VUs, 55 complete and 0 interrupted iterations
order_creation   [  20% ] 30 VUs  06.0s/30s
order_query      [  20% ] 5 VUs   06.0s/30s

running (0m07.0s), 35/35 VUs, 65 complete and 0 interrupted iterations
order_creation   [  23% ] 30 VUs  07.0s/30s
order_query      [  23% ] 5 VUs   07.0s/30s

running (0m08.0s), 35/35 VUs, 75 complete and 0 interrupted iterations
order_creation   [  27% ] 30 VUs  08.0s/30s
order_query      [  27% ] 5 VUs   08.0s/30s

running (0m09.0s), 35/35 VUs, 85 complete and 0 interrupted iterations
order_creation   [  30% ] 30 VUs  09.0s/30s
order_query      [  30% ] 5 VUs   09.0s/30s

running (0m10.0s), 35/35 VUs, 95 complete and 0 interrupted iterations
order_creation   [  33% ] 30 VUs  10.0s/30s
order_query      [  33% ] 5 VUs   10.0s/30s

running (0m11.0s), 35/35 VUs, 105 complete and 0 interrupted iterations
order_creation   [  37% ] 30 VUs  11.0s/30s
order_query      [  37% ] 5 VUs   11.0s/30s

running (0m12.0s), 35/35 VUs, 115 complete and 0 interrupted iterations
order_creation   [  40% ] 30 VUs  12.0s/30s
order_query      [  40% ] 5 VUs   12.0s/30s

running (0m13.0s), 35/35 VUs, 125 complete and 0 interrupted iterations
order_creation   [  43% ] 30 VUs  13.0s/30s
order_query      [  43% ] 5 VUs   13.0s/30s

running (0m14.0s), 35/35 VUs, 135 complete and 0 interrupted iterations
order_creation   [  47% ] 30 VUs  14.0s/30s
order_query      [  47% ] 5 VUs   14.0s/30s

running (0m15.0s), 35/35 VUs, 145 complete and 0 interrupted iterations
order_creation   [  50% ] 30 VUs  15.0s/30s
order_query      [  50% ] 5 VUs   15.0s/30s
time="2026-04-27T09:20:04+09:00" level=warning msg="Request Failed" error="Post \"http://34.64.219.137/api/orders\": request timeout"
time="2026-04-27T09:20:04+09:00" level=warning msg="Request Failed" error="Post \"http://34.64.219.137/api/orders\": request timeout"
time="2026-04-27T09:20:04+09:00" level=warning msg="Request Failed" error="Post \"http://34.64.219.137/api/orders\": request timeout"
[...]

running (0m16.0s), 35/35 VUs, 185 complete and 0 interrupted iterations
order_creation   [  53% ] 30 VUs  16.0s/30s
order_query      [  53% ] 5 VUs   16.0s/30s

running (0m17.0s), 35/35 VUs, 195 complete and 0 interrupted iterations
order_creation   [  57% ] 30 VUs  17.0s/30s
order_query      [  57% ] 5 VUs   17.0s/30s

running (0m18.0s), 35/35 VUs, 208 complete and 0 interrupted iterations
order_creation   [  60% ] 30 VUs  18.0s/30s
order_query      [  60% ] 5 VUs   18.0s/30s

running (0m19.0s), 35/35 VUs, 233 complete and 0 interrupted iterations
order_creation   [  63% ] 30 VUs  19.0s/30s
order_query      [  63% ] 5 VUs   19.0s/30s

running (0m20.0s), 35/35 VUs, 254 complete and 0 interrupted iterations
order_creation   [  67% ] 30 VUs  20.0s/30s
order_query      [  67% ] 5 VUs   20.0s/30s

running (0m21.0s), 35/35 VUs, 271 complete and 0 interrupted iterations
order_creation   [  70% ] 30 VUs  21.0s/30s
order_query      [  70% ] 5 VUs   21.0s/30s

running (0m22.0s), 35/35 VUs, 288 complete and 0 interrupted iterations
order_creation   [  73% ] 30 VUs  22.0s/30s
order_query      [  73% ] 5 VUs   22.0s/30s

running (0m23.0s), 35/35 VUs, 306 complete and 0 interrupted iterations
order_creation   [  77% ] 30 VUs  23.0s/30s
order_query      [  77% ] 5 VUs   23.0s/30s

running (0m24.0s), 35/35 VUs, 327 complete and 0 interrupted iterations
order_creation   [  80% ] 30 VUs  24.0s/30s
order_query      [  80% ] 5 VUs   24.0s/30s

running (0m25.0s), 35/35 VUs, 362 complete and 0 interrupted iterations
order_creation   [  83% ] 30 VUs  25.0s/30s
order_query      [  83% ] 5 VUs   25.0s/30s

running (0m26.0s), 35/35 VUs, 395 complete and 0 interrupted iterations
order_creation   [  87% ] 30 VUs  26.0s/30s
order_query      [  87% ] 5 VUs   26.0s/30s

running (0m27.0s), 35/35 VUs, 428 complete and 0 interrupted iterations
order_creation   [  90% ] 30 VUs  27.0s/30s
order_query      [  90% ] 5 VUs   27.0s/30s

running (0m28.0s), 35/35 VUs, 462 complete and 0 interrupted iterations
order_creation   [  93% ] 30 VUs  28.0s/30s
order_query      [  93% ] 5 VUs   28.0s/30s

running (0m29.0s), 35/35 VUs, 496 complete and 0 interrupted iterations
order_creation   [  97% ] 30 VUs  29.0s/30s
order_query      [  97% ] 5 VUs   29.0s/30s

running (0m30.0s), 35/35 VUs, 535 complete and 0 interrupted iterations
order_creation   [ 100% ] 30 VUs  30.0s/30s
order_query      [ 100% ] 5 VUs   30.0s/30s


  █ THRESHOLDS 

    order_create_duration
    ✗ 'p(95)<3000' p(95)=14.99s

    order_query_duration
    ✓ 'p(95)<1000' p(95)=20.34ms


  █ TOTAL RESULTS 

    checks_total.......: 1140   37.000443/s
    checks_succeeded...: 71.49% 815 out of 1140
    checks_failed......: 28.50% 325 out of 1140

    ✗ health query: 200
      ↳  0% — ✓ 0 / ✗ 295
    ✓ health query: fast (<500ms)
    ✗ order create: 201 or 503 fast-fail
      ↳  89% — ✓ 245 / ✗ 30
    ✓ order create: not 5xx other

    CUSTOM
    order_create_duration...: avg=3.21s  min=290.69ms med=1.41s    max=14.99s p(90)=14.99s  p(95)=14.99s 
    order_create_errors.....: 100.00% 275 out of 275
    order_query_duration....: avg=8.53ms min=4.76ms   med=6.9ms    max=38.1ms p(90)=13.71ms p(95)=20.34ms

    HTTP
    http_req_duration.......: avg=1.55s  min=4.76ms   med=22.75ms  max=14.99s p(90)=3.41s   p(95)=14.99s 
    http_req_failed.........: 100.00% 570 out of 570
    http_reqs...............: 570     18.500221/s

    EXECUTION
    iteration_duration......: avg=1.86s  min=391.11ms med=519.05ms max=15.1s  p(90)=3.51s   p(95)=15.1s  
    iterations..............: 570     18.500221/s
    vus.....................: 35      min=35         max=35
    vus_max.................: 35      min=35         max=35

    NETWORK
    data_received...........: 130 kB  4.2 kB/s
    data_sent...............: 152 kB  4.9 kB/s



running (0m30.8s), 00/35 VUs, 570 complete and 0 interrupted iterations
order_creation ✓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s
time="2026-04-27T09:20:20+09:00" level=error msg="thresholds on metrics 'order_create_duration' have been crossed"