docs/evidence/04-circuit-breaker/solution/k6.txt
  █ THRESHOLDS 

    order_create_duration
    ✓ 'p(95)<3000' p(95)=1.64s

    order_query_duration
    ✓ 'p(95)<1000' p(95)=13.29ms


  █ TOTAL RESULTS 

    checks_total.......: 3278   107.691478/s
    checks_succeeded...: 90.78% 2976 out of 3278
    checks_failed......: 9.21%  302 out of 3278

    ✗ health query: 200
      ↳  0% — ✓ 0 / ✗ 300
    ✓ health query: fast (<500ms)
    ✗ order create: 201 or 503 fast-fail
      ↳  99% — ✓ 1338 / ✗ 1
    ✗ order create: not 5xx other
      ↳  99% — ✓ 1338 / ✗ 1

    CUSTOM
    order_create_duration..........: avg=575.46ms min=44.33ms  med=372.52ms max=8.52s   p(90)=684.51ms p(95)=1.64s  
    order_create_errors............: 99.32% 1330 out of 1339
    order_query_duration...........: avg=2.87ms   min=553.62µs med=1.05ms   max=38.59ms p(90)=5.78ms   p(95)=13.29ms

    HTTP
    http_req_duration..............: avg=470.65ms min=553.62µs med=303.53ms max=8.52s   p(90)=608.58ms p(95)=1.04s  
      { expected_response:true }...: avg=8.39s    min=8.32s    med=8.34s    max=8.52s   p(90)=8.52s    p(95)=8.52s  
    http_req_failed................: 99.45% 1630 out of 1639
    http_reqs......................: 1639   53.845739/s

    EXECUTION
    iteration_duration.............: avg=645.27ms min=145.43ms med=501.38ms max=8.63s   p(90)=710.57ms p(95)=1.14s  
    iterations.....................: 1639   53.845739/s
    vus............................: 35     min=35           max=35
    vus_max........................: 35     min=35           max=35

    NETWORK
    data_received..................: 483 kB 16 kB/s
    data_sent......................: 730 kB 24 kB/s



running (0m30.4s), 00/35 VUs, 1639 complete and 0 interrupted iterations
order_creation ✓ [ 100% ] 30 VUs  30s
order_query    ✓ [ 100% ] 5 VUs   30s